# Team standings

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

Write a query to return the scores of each team in the teams table after all matches displayed in the matches table. Points are awarded as follows: zero points for a loss, one point for a tie, and three points for a win. The result should include team name and points, and be ordered by decreasing points. In case of a tie, order by alphabetized team name.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `teams` table

In [3]:
%%sql

DROP TABLE IF EXISTS teams;
CREATE TABLE teams (
    id INT,
    city VARCHAR(20)
);

INSERT INTO teams
VALUES
    (1, 'New York'),
    (2, 'Atlanta'),
    (3, 'Chicago'),
    (4, 'Toronto'), 
    (5, 'Los Angeles'), 
    (6, 'Seattle');
    
SELECT * FROM teams;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.

[(1, 'New York'),
 (2, 'Atlanta'),
 (3, 'Chicago'),
 (4, 'Toronto'),
 (5, 'Los Angeles'),
 (6, 'Seattle')]

## The `matches` table

In [4]:
%%sql

DROP TABLE IF EXISTS matches;
CREATE TABLE matches (
    match_id INT,
    host_team INT,
    guest_team INT,
    host_goals INT,
    guest_goals INT
);

INSERT INTO matches
VALUES
    (1, 1, 2, 3, 0),
    (2, 2, 3, 2, 4),
    (3, 3, 4, 4, 3),
    (4, 4, 5, 1, 1),
    (5, 5, 6, 2, 1), 
    (6, 6, 1, 1, 2);

SELECT * FROM matches;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.

[(1, 1, 2, 3, 0),
 (2, 2, 3, 2, 4),
 (3, 3, 4, 4, 3),
 (4, 4, 5, 1, 1),
 (5, 5, 6, 2, 1),
 (6, 6, 1, 1, 2)]

## The expected output

| team_name   | total_points |
|------------ |------------- |
| Chicago     | 6            |
| New York    | 6            |
| Los Angeles | 4            |
| Toronto     | 2            |
| Atlanta     | 0            |
| Seattle     | 0            |

# Type your SQL below

In [5]:
# %%sql
#
# Type your query here